package com.nubnasir.gmail.weatherbd;

import android.app.Activity;
import android.graphics.Typeface;
import android.os.Bundle;
import android.view.View;
import android.view.View.OnClickListener;
import android.view.Window;
import android.widget.Button;
import android.widget.TextView;

public class WhatToDoEarthquakeActivity  extends Activity {

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		requestWindowFeature(Window.FEATURE_NO_TITLE);
		setContentView(R.layout.whattodo_eartrhquake);

		TextView title=(TextView)findViewById(R.id.titlewhat);
		Button exit=(Button)findViewById(R.id.exitwhat);
		TextView t1=(TextView)findViewById(R.id.t1);
		TextView t2=(TextView)findViewById(R.id.t2);
		TextView t3=(TextView)findViewById(R.id.t3);
		TextView t4=(TextView)findViewById(R.id.t4);
		TextView dt1=(TextView)findViewById(R.id.dt1);
		TextView dt2=(TextView)findViewById(R.id.dt2);
		TextView dt3=(TextView)findViewById(R.id.dt3);
		TextView dt4=(TextView)findViewById(R.id.dt4);
		
		exit.setOnClickListener(new OnClickListener() {
			
			@Override
			public void onClick(View arg0) {
				// TODO Auto-generated method stub
				finish();
			}
		});

		Typeface custom_font = Typeface.createFromAsset(getAssets(),
				"banglafont.ttf");
		title.setTypeface(custom_font);
		t1.setTypeface(custom_font);
		t2.setTypeface(custom_font);
		t3.setTypeface(custom_font);
		t4.setTypeface(custom_font);
		dt1.setTypeface(custom_font);
		dt2.setTypeface(custom_font);
		dt3.setTypeface(custom_font);
		dt4.setTypeface(custom_font);
		title.setText("ভূমিকম্পে করনীয়");
		t1.setText("বের হওয়ার ক্ষেত্রেঃ");
		t2.setText("যদি বের না হতে পারেনঃ");
		t3.setText("ভুমিকম্পের সময় করণীয়ঃ");
		t4.setText("ভূমিকম্প হওয়ার পর কয়েক ঘন্টার মধ্যে করণীয়ঃ");
		dt1.setText("১. তারাহুড়ো না করে, সতর্কতার সাথে বের হোন\n২. খোলা স্থানে অবস্থান নিন\n৩. গ্যাস-এর লাইন, ইলেকট্রিসিটি-র লাইন, এ-সব থেকে দূরে থাকুন\n৪. জানালা হতে দূরে থাকুন\n৫. দেয়াল হতে দূরে অবস্থান নিন\n");
		dt2.setText("১. তারাহুড়ো করবেন না\n২. ঘরের দরজা খুলে ঠিক দরজা-র নীচ বরাবর অবস্থান করূন\n৩. গ্যাস-এর চুলা এবং ইলেকট্রিসিটি বন্ধ করে দিন\n৪. জানালা হতে দূরে থাকুন\n৫. কাচঁ-এর জিনিস যেমনঃ ফুল-দানি, শো-কেস , ড্রেসিং-টেবিল এ-সব থেকে দূরে থাকুন\n৭. ঘরের যে-কোনো ভারী দ্রব্য যেমনঃ টেবিল-এর নীচ বরাবর অবস্থান নিতে পারেন\n");
		dt3.setText("১. ভুমিকম্পের প্রথম ঝাঁকুনির সাথে-সাথে পরিবারের সবাইকে নিয়ে খোলা স্থানে আশ্রয় নিন।\n২. যদি ঘর থেকে বের হতে না পারেন তবে, ইটের গাথুনির পাকা ঘর হলে- ঘরের কোনায়, কলাম ও বিমের তৈরী ভবন হলে- কলামের গোড়ায় আশ্রয় নিন।\n৩. আপনার বাসস্থান আধাপাকা বা টিনের তৈরী হলে খাটের নিচে আশ্রয় নিন।\n৪. ভুমিকম্প রাতের বেলায় হলে কিংবা দ্রুত বের হতে না পারলে সজাগ হওয়ার সাথে সাথে ঘরের কোনে, কলামের গোড়ায় কিংবা শক্ত খাট বা টেবিলের নিচে আশ্রয় নিন।\n৫. ঘরে হেলমেট জতীয় কিছু থাকলে দ্রুত নিজের মাথায় পরুন ও অন্যদের পরতে বলুন।\n৬. রাতে ঘুমানোর সময় ভুমিকম্প হলে কোন হুড়াহুড়ি না করে গড়িয়ে মেঝেতে কুন্ডলি পাকিয়ে শুয়ে পড়ুন বিছানাকে ঢাল বানিয়ে। খেয়াল রাখবেন যেন বিচানার নীচে চলে না যান, বিছানার পাশে আশ্রয় নিন।\n৭. বিল্ডিং ভেঙ্গে পড়ার সময় সিলিং যখন কোন অবজেক্টের ওপর পড়ে একে গুঁড়িয়ে দেয়, ঠিক তার পাশেই ছোট্ট একটি খালি জায়গা বা void-এর সৃষ্টি হয়। একে বলা হয় সেফটি জোন বা ট্রায়াঙ্গল অফ লাইফ। তাই ভূমিকম্পের সময় বড় কোন সোফা বা বড় কোন অবজেক্ট যেটা কম কম্প্রেস করবে- এরকম কিছুর পাশে আশ্রয় নিলে বাঁচার সম্ভাবনা বেশি থাকে।\n৮. ভূমিকম্পের সময় জানালা বা বারান্দা দিয়ে লাফ দেয়া এসবও করবেন না। কোন সোফা বা সাত নাম্বার পয়েন্টে যেভাবে বলেছি সেভাবে ঘরের মধ্যেই কোন অবজেক্টের পাশে আশ্রয় নিন।\n৯. ইন্ড্রাষ্টি কিংবা কারখানায় থাকলে দ্রুত বৈদ্যুতিক সুইচ ও গ্যাস লাইন বন্ধ করে দিন।\n১০. টাকা-পয়সা, সোনা-দানা কোন কিছু সংগে নেওয়ার লোভে অযথা সময় নষ্ট করবেন না।\n১১. এই সময় কোনমতেই লিফট ব্যবহার করবেন না। কেননা বিদ্যুৎ বন্ধ হয়ে লিফট বন্ধ হয়ে আপনি সেখানে আটকা পড়তে পারেন।\n১২. ভূমিকম্পের সময় কখনই সিঁড়িতে আশ্রয় নেবেন না। সিঁড়ির ‘মোমেন্ট অফ ফ্রিকোয়েন্সী’ বিল্ডিং-এর চাইতে ভিন্ন হয় এবং অনেক সময় বিল্ডিং ভেঙ্গে না পড়লেও সিঁড়ি দ্রুত ভেঙ্গে পড়ে।\n১৩. আপনি যদি গাড়ি চালানো অবস্থায় থাকেন, তবে সাবধানতার সাথে গাড়ি থামিয়ে দ্রুত ফাকাঁ স্থান দেখে গাড়িতেই অবস্থান করুন। চেস্টা করুন বিল্ডিং, গাছপালা, বিদ্যুৎ এর খুঁটি,লাইট পোস্ট হতে দূরে থাকতে।\n১৪. বড় ভূমিকম্পের পরপরই আরেকটা ছোট ভূমিকম্প হয় যেটাকে ‘আফটার শক’ বলে। এটার জন্যও সতর্ক থাকুন।\n");
		dt4.setText("১. বৈদ্যুতিক,গ্যাস চালিত সব ধুরনের যন্ত্রপাতি ব্যবহারে বিরত থাকুন।\n২. যদি বহুতল ভবনের ওপরের দিকে কোনো তলায় আটকা পড়েন, বেরিয়ে আসার কোনো পথই না থাকে, তবে সাহস হারাবেন না। ধৈর্য ধরে অপেক্ষা করুন। আপনি এখানে আছেন সেটা উদ্ধারকারি দলের কাছে আওয়াজ পৌছানোর চেষ্টা করুন।\n৩. ভুমিকম্পের কারণে যদি আপনি আহত হন বা বিম, দেয়াল, স্লাব বা কংক্রিটের তৈরী কোন অংশে আপনার শরীর আটকে গেলে বা চাপা পড়লে বের হবার সুয়োগ যদি না-ই থাকে তবে বেশী টানা-হেচড়া করবেন না এতে অতিরিক্ত রক্তক্ষরন হয়ে আপনার দ্রুত মৃত্যু হতে পারে।\n৪. ভূমিকম্পের ফলে after shocks,effect যেমন সুনামি হতে পারে। সেজন্য প্রয়োজনীয় প্রস্ততি নিন।\n৫. রেডিও থাকলে দূর্যোগ সম্পর্কিত প্রয়োজনীয় তথ্য পাবার জন্য সেটি চালু রাখুন। টেলিফোন,মোবাইল চালু থাকলে প্রয়োজনীয় সাহায্য চাওয়ার জন্য এবং ক্ষয়ক্ষতি রিপোর্ট করার জন্য সেটি ব্যবহার করুন।\n৬. ধুলাবালি থেকে বাঁচার জন্য আগেই সাথে রুমাল বা তোয়ালে বা চাদরের ব্যবস্থা করে রাখুন।\n৭. ম্যাচ জ্বালাবেন না। দালান ধ্বসে পড়লে গ্যাস লিক হয়ে থাকতে পারে।\n৮. ছোটখাট আঘাতে সম্ভব হলে নিজের পরিধেয় বস্ত্র ছিড়ে ক্ষতস্থান বেধে দিন।\n৯. চিৎকার করে ডাকাডাকি শেষ অপশন হিসেবে বিবেচনা করুন। কারণ, চিৎকারের সময় মুখে ক্ষতিকারক ধুলাবালি ঢুকে যেতে পারে। পাইপে বা ওয়ালে বাড়ি দিয়ে বা মুখে শিস বাজিয়ে দৃষ্টি আকর্ষণের চেষ্টা করতে পারেন। তবে ভাল হয় সাথে যদি একটা রেফারির বাঁশি বা হুইসেল থাকে, তার প্রিপারেশন নিয়ে রাখুন আগেই।\n১০. একজায়গাতে,রাস্তাতে জড়ো না হয়ে বরং সড়কপথকে ফাকাঁ রাখুন যাতে জরুরী সাহায্যের যানবাহন দ্রুত চলাচল করতে পারে।\n১১. আহত লোকদের যতটুকু সম্ভব সাহায্য করুন। কেউ আটকা পড়লে চেস্টা করুন উদ্ধারের। না পারলে তাকে বা তাদেরকে পানি ও খাবার দিন এবং অভয় দিন।\n১২. মনে রাখবেন আপনার উত্তেজনা কিংবা ভয় আপনার জন্য সবচেয়ে বেশী ক্ষতির কারন হবে তাই যত বিপদেই পড়ুন না কেন কখনোই সাহস হারাবেন না\n");
	}

}
